brains/app/controllers/questions_controller.rb

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", 5]]
SELECT "questions"."id" FROM "questions" WHERE "questions"."quiz_id" = ?  ORDER BY "questions"."created_at" ASC  [["quiz_id", 23]]
---
  def show
  	@question = Question.find(params[:id])

    current_id = params[:id].to_i

    @quiz = @question.quiz
    questions = @quiz.questions.order(:created_at).ids # [1,2,3]