brains/app/controllers/quizzes_controller.rb

SELECT  "questions".* FROM "questions" WHERE "questions"."quiz_id" = ?  ORDER BY "questions"."id" ASC LIMIT 1  [["quiz_id", 17]]
---
  def show
  	@quiz= Quiz.find(params[:id])
    if @quiz.questions.present?